

<?php

//$HiLo1 = 1;
//while ($HiLo1 < 11) {
  //  echo "ครั้งที่"."$HiLo1";
 //   $HiLo1++;
  //  $HiLo= rand(1, 18);
  //      if($HiLo<10){
  //      echo "เลขที่ได้ = ".$HiLo."ต่ำ<br>";
  //  }else if($HiLo<12){
  //      echo "เลขที่ได้ = ". $HiLo."กลาง<br>";
 //   }else if($HiLo<18){
      //  echo "เลขที่ได้ = ". $HiLo."สูง<br>";
 
//}
   // }
   //$thai_day_arr=array("อาทิตย์","จันทร์","อังคาร","พุธ","พฤหัสบดี","ศุกร์","เสาร์");
   //$thai_day_number=date("d");
   //$thai_month_arr=array( "0"=>"", "1"=>"มกราคม","2"=>"กุมภาพันธ์", "3"=>"มีนาคม","4"=>"เมษายน","5"=>"พฤษภาคม", "6"=>"มิถุนายน", "7"=>"กรกฎาคม","8"=>"สิงหาคม", "9"=>"กันยายน", "10"=>"ตุลาคม", "11"=>"พฤศจิกายน","12"=>"ธันวาคม");
   //$thai_day_y=(date("Y")+543);
 // echo "วัน".$thai_day_arr[2]."ที่".$thai_day_number."เดือน".$thai_month_arr[12]."พ.ศ".$thai_day_y."<br>";
  
 
 //<form>
  //กรุณากรอกตัวเลข :<input type="text" name="textinput">
    //<input type="submit" value="ส่ง">
//</form>
//$text="54324";
//$text_md5=md5($text);
//echo"เข้ารหัสได้คือ".$text_md5."<br>";
//echo"=============================================<br>";
//$textinput=$_GET["textinput"];
//if(md5($textinput)==$text_md5)
//echo"ตัวเลขที่กรอกถูก ";
//else
//echo"ตัวเลขที่กรอกผิด";

$str = "1/4/2006";
(explode(" ",$str));
$month=array( "0"=>"", "1"=>"มกราคม","2"=>"กุมภาพันธ์", "3"=>"มีนาคม","4"=>"เมษายน",
"5"=>"พฤษภาคม", "6"=>"มิถุนายน", "7"=>"กรกฎาคม","8"=>"สิงหาคม", "9"=>"กันยายน", "10"=>
"ตุลาคม", "11"=>"พฤศจิกายน","12"=>"ธันวาคม");

echo "วันที่ ".$str[0]." เดือน ".$month[4]." ค.ศ ".$str[4].$str[5].$str[6].$str[7]."<br>";

?>